packages/insomnia-importers/src/importers/fixtures/wsdl/addition-output.json

{
  "_type": "export",
  "__export_format": 4,
  "__export_date": "2018-01-09T23:32:46.908Z",
  "__export_source": "insomnia.importers:v0.1.0",
  "resources": [
    {
      "parentId": "__WORKSPACE_ID__",
      "_id": "__GRP_1__",
      "_type": "request_group",
      "name": "Calculator",
      "description": "",
      "environment": {}
    },
    {
      "parentId": "__GRP_1__",
      "_id": "__GRP_2__",
      "_type": "request_group",
      "name": "Calculator",
      "description": "",
      "environment": {}
    },
    {
      "parentId": "__GRP_2__",
      "_id": "__REQ_1__",
      "_type": "request",
      "name": "Add",
      "description": "",
      "url": "http://www.dneonline.com/calculator.asmx",
      "method": "POST",
      "headers": [
        { "name": "SOAPAction", "value": "http://tempuri.org/Add" },
        { "name": "Content-Type", "value": "text/xml" },
        { "name": "Accept", "value": "application/xml" }
      ],
      "body": {
        "mimeType": "",
        "text": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">\n <soapenv:Header>\n  <!-- The Security element should be removed if WS-Security is not enabled on the SOAP target-url -->\n  <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n   <wsse:UsernameToken>\n    <wsse:Username>string</wsse:Username>\n    <wsse:Password>string</wsse:Password>\n    <wsse:Nonce EncodingType=\"string\">string</wsse:Nonce>\n    <wsu:Created>string</wsu:Created>\n   </wsse:UsernameToken>\n   <wsu:Timestamp wsu:Id=\"string\">\n    <wsu:Created>string</wsu:Created>\n    <wsu:Expires>string</wsu:Expires>\n   </wsu:Timestamp>\n  </wsse:Security>\n </soapenv:Header>\n <soapenv:Body>\n  <tns:Add xmlns:tns=\"http://tempuri.org/\"><!-- mandatory -->\n   <tns:intA><!-- mandatory -->3</tns:intA>\n   <tns:intB><!-- mandatory -->3</tns:intB>\n  </tns:Add>\n </soapenv:Body>\n</soapenv:Envelope>"
      },
      "authentication": {},
      "parameters": []
    }
  ]
}
