packages/insomnia-importers/src/__tests__/fixtures/wsdl/addition-output.json

{
  "_type": "export",
  "__export_format": 4,
  "__export_date": "2018-01-09T23:32:46.908Z",
  "__export_source": "insomnia.importers:v0.1.0",
  "resources": [
    {
      "_id": "__GROUP_1__",
      "_type": "request_group",
      "parentId": "__WORKSPACE_ID__",
      "name": "Calculator",
      "environment": {
        "base_url": "http://www.dneonline.com/calculator.asmx"
      }
    },
    {
      "parentId": "__GROUP_1__",
      "name": "Add",
      "url": "{{ base_url }}",
      "body": {
        "mimeType": "application/xml",
        "text": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <tem:Add>\r\n         <tem:intA>5</tem:intA>\r\n         <tem:intB>10</tem:intB>\r\n      </tem:Add>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"
      },
      "headers": [
        {
          "name": "Content-Type",
          "value": "text/xml"
        }
      ],
      "authentication": {},
      "parameters": [],
      "method": "POST",
      "_type": "request",
      "_id": "__REQUEST_1__"
    }
  ]
}
