JSON/AssignmentMultiply.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:Multiply>
         <tem:intA>10</tem:intA>
         <tem:intB>10</tem:intB>
      </tem:Multiply>
   </soap:Body>
</soap:Envelope>