target/classes/templates/substract-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Subtract>
         <tem:intA>${headers.num1}</tem:intA>
         <tem:intB>${headers.num2}</tem:intB>
      </tem:Subtract>
   </soapenv:Body>
</soapenv:Envelope>