SoapRequest/divide.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Divide xmlns="http://tempuri.org/">
            <intA>5</intA>
            <intB>2</intB>
        </Divide>
    </Body>
</Envelope>