Test/RobotFramework/request_subtract.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Subtract xmlns="http://tempuri.org/">
      <intA>10</intA>
      <intB>5</intB>
    </Subtract>
  </soap:Body>
</soap:Envelope>