src/test/resources/add.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>7</intA>
            <intB>9</intB>
        </Add>

    </Body>
</Envelope>